[
    {
        "input": "Need po ba ng prospectus kapag kukuha ka SOG sa school? or hindi na po?",
        "output": "Hindi na po. Kailangan mong kumuha ng Summary of Grades (SOG) para makakuha ng Prospectus. Pumunta ka lang sa Window 2 or Window 3."
    },
    {
        "input": "Paano kumuha ng SOG?",
        "output": "Pwede kang mag-email sa mganda@icct.edu.ph para makapag-appoint ka ng Summary of Grades (SOG). Pag may appointment date ka na, dalhin ang Proof of Payment (printed), tapos pumunta sa Registrar Window 15 (Cainta Branch). STRICTLY 9AM-2PM ONLY."
    },
    {
        "input": "Pati po ba mga second-year kasama sa intrams?",
        "output": "Lahat po ay kasama sa Intrams."
    },
    {
        "input": "Ano kailangan para maka-kuha ng Test Booklet?",
        "output": "Magdala ka lang ng official Registration Form (ORF)."
    },
    {
        "input": "May pasok pa rin ba ang mga pang-umaga pag may general assembly?",
        "output": "Depende po sa instructor niyo."
    },
    {
        "input": "Ano address ng ICCT Cainta Campus?",
        "output": "Ang address ng ICCT Cainta Campus ay V. V. Soliven Avenue II, Bgy. San Isidro, Cainta, Rizal (across Sta. Lucia East Grand Mall)."
    },
    {
        "input": "Ano ang telephone number ng ICCT College Cainta?",
        "output": "Ang telephone number ng ICCT College ay (02)7.955.6284, (02)8.249.2367. Ang mga mobile numbers ay 0947.895.4228, 0932.872.4228, at 0917.814.4228."
    },
    {
        "input": "Paano kung blanko ako sa grades ko sa Summary of Grades?",
        "output": "Kailangan mong pumunta sa Window 9 ng Registrar para magpa-verify ng grades."
    },
    {
        "input": "Saan ako magpapa-evaluate ng grades ko?",
        "output": "Pumunta ka sa Window 1 or Window 3 para makapag-evaluate ka ng grades mo."
    },
    {
        "input": "Ano requirement para makapasok sa Latin Honors?",
        "output": "Ang kandidato ay dapat matugunan ang mga specific academic at leadership criteria na itinakda ng kolehiyo."
    },
    {
        "input": "Saan po mag eenroll mga 1st year",
        "output": "Go to sms.icct.edu.ph and mag register sa New Student Application Portal and fill up the Registration Form."
    },
    {
        "input": "Saan po mag bayad ng Uniform?",
        "output": "Go to sms.icct.edu.ph, login, then go to the Account and PayOnline section. You will get a Reference Number, then you can pay it on GCash."
    },
    {
        "input": "Saan ko pwede makuha yung Grades ko?",
        "output": "You can go to sms.icct.edu.ph/student/grades to view your grades or make an appointment to get the Summary of Grades (SOG)."
    },
    {
        "input": "Paano magpaevaluate ng Prospectus?",
        "output": "Maari kang pumunta sa Window 1 or 3 para magpa-evaluate ng iyong prospectus."
    },
    {
        "input": "Ano ang kailangan para makapag pa evaluate ng prospectus?",
        "output": "Kailangan mong dalhin ang original at updated na SOG at kopya ng iyong Form 137 at PSA."
    },
    {
        "input": "Kailangan po bang laging updated ang iyong PROSPECTUS?",
        "output": "Yes, kailangan po updated ang iyong Prospectus para hindi tayo magkaroon ng problema kapag tayo ay mag-aapply na ng internship."
    },
    {
        "input": "Paano Bumili ng Uniform ng ICCT Colleges?",
        "output": "Need mong mag-purchase muna sa Portal ng iyong Uniform at pagkatapos noon ay pwede ka na pumunta sa ICCT para i-claim ang iyong uniform."
    },
    {
        "input": "Nawala po ang ID ko, ano po ba ang pwedeng gawin para po makakuha ulit ng ID?",
        "output": "Kailangan mo po muna kumuha ng Affidavit of Loss at magbayad para makakuha ulit ng iyong panibagong ID."
    },
    {
        "input": "Kailangan po ba mag uniform kapag 3pm onwards ang pasok?",
        "output": "Ang may klase ng 3pm onwards ay hindi na kailangan mag-uniform, pero nakadepende pa rin ito sa mga inyong subject professor."
    },
    {
        "input": "Paano po magbayad ng Tuition sa GCash?",
        "output": "Kailangan mong mag-generate ng Reference Number sa Portal at ilagay iyon sa iyong GCash Account para makapagbayad."
    },
    {
        "input": "Open po ba ang Campus Tuwing Sunday?",
        "output": "Hindi po."
    },
    {
        "input": "Paano po magenroll ang existing student sa susunod ng Sem?",
        "output": "Maari pong maghintay sa announcement ng School kung kailan ang schedule ng enrollment ng iyong course at gamitin ang portal para makapagenroll."
    },
    {
        "input": "Sumobra po ang Bayad ko sa Tuition maari ko po bang makuha nag sobrang ipinangbayad ko?",
        "output": "Yes po! Maari mag-email sa accountant ng ICCT at hintayin ang kanilang reply kung kailan mo pwedeng kuhanin ang sobrang ipinangbayad mo."
    },
    {
        "input": "Irregular Student po ako, Pwede po ba ako magpa-add ng subject sa enrollment?",
        "output": "Yes po, pwede ka magpa-add ng subject sa pamamagitan ng walk-in enrollment."
    },
    {
        "input": "Maintenance po ang GCash Payment ng ICCT, san po ako pwede magbayad?",
        "output": "Pwede ka po magbayad sa Paymaya or Over the Counter katulad ng Cebuana."
    },
    {
        "input": "Pwede ko po ba mapabago ang Grades ko sa Porta/SOG?",
        "output": "Kung nagkaroon ka ng problema sa iyong grades at ito ay nag-reflect sa iyong SOG, maari mong kausapin ang iyong Subject Teacher at ayusin ito para maayos ang grades mo sa SOG."
    },
    {
        "input": "Napa-evaluate ko na po yung Grade na Mali sa Prospectus, Pwede ko po bang pabaguhin iyon?",
        "output": "Pwede po as long as nabago na ang iyong grades sa iyong updated na SOG."
    },
    {
        "input": "Saang Window po pwede magpa-dry seal?",
        "output": "Window 6 po."
    },
    {
        "input": "Saan makikita ang Exam Permit?",
        "output": "Makikita ang iyong Exam Permit sa ORF."
    },
    {
        "input": "Pwede po ba mag-join sa iba't ibang Club?",
        "output": "Pwede po sumali sa mahigit sa isang Club."
    },
    {
        "input": "Pwede po ba ako mag-participate sa iba't ibang activities sa ICCT?",
        "output": "Opo, pwede po."
    },
    {
        "input": "Maari po ba pumasok sa Library sa ICCT?",
        "output": "Pwede po."
    },
    {
        "input": "Ano po ang kailangan para makapasok sa Library?",
        "output": "School ID or Library ID."
    },
    {
        "input": "Bawal po ba ang may Kulay na Buhok sa ICCT?",
        "output": "Bawal ang may kulay na buhok sa ICCT, papayagan lamang ang mga studyante na may natural shades ng buhok."
    },
    {
        "input": "Saan po yung CR ng Babae?",
        "output": "Ang CR ng babae ay makikita sa Dulo ng LEFT SIDE ng Building 4 (B4) at meron din sa Building 2 (B2) sa RIGHT SIDE."
    },
    {
        "input": "Saan yung B223?",
        "output": "Ang B2-23 ay makikita sa Second Floor (2ND FLOOR) LEFT SIDE."
    },
    {
        "input": "Saan makikita yung B224?",
        "output": "Ang B2-24 ay makikita sa Second Floor (2ND FLOOR) RIGHT SIDE."
    },
    {
        "input": "Saan yung CR ng mga lalake?",
        "output": "Ang CR ng mga lalake ay makikita sa Center ng Building 2 (B2) at Building 4 (B4)."
    },
    {
        "input": "Saan yung b223",
        "output": "Ang B2-23 ay makikita sa Second Floor (2ND FLOOR) LEFT SIDE."
    },
    {
        "input": "Where is the b223?",
        "output": "The B2-23 can be found on the Second Floor (2ND FLOOR) LEFT SIDE."
    },
    {
        "input": "Kailan po p'wede magpaverify ng grades?",
        "output": "Once you have received your summary of grades, you can go to window nine with it and your letter to verify your grades."
    },
    {
        "input": "Ano pong gagawin kapag may INC akong grades?",
        "output": "You can request a summary of grades or go to window nine to verify the grades that are marked as incomplete (INC)."
    },
    {
        "input": "I lost my ID card. How can I get a replacement?",
        "output": "Yes, you can get a replacement ID card by visiting the library and asking the staff there."
    },
    {
        "input": "Paano po ako makakakuha ng prospectus?",
        "output": "You need to bring the latest copy of SOG and a copy of PSA."
    },
    {
        "input": "Tatanggapin kaya ng registrar kung hindi naka sealed envelope yung form 137 ko?",
        "output": "I will check on that for you."
    },
    {
        "input": "Paano po magdrop ng subject?",
        "output": "Visit the guidance office to file a request for dropping a subject."
    },
    {
        "input": "When is the graduation ceremony?",
        "output": "In the months of December and May."
    },
    {
        "input": "Paano po kukuha ng diploma ang mga recently graduates?",
        "output": "Simply call the Registrar Office kung available na for releasing ang iyong diploma."
    },
    {
        "input": "What types of events are held on campus?",
        "output": "Multi-campus student activities like RoboTHINKS Exhibit & Competition, Inter & Intra Quiz Bee, Mr. & Mrs. ICCT Colleges Pageant, Inter & Intra Quiz Bee, Foundation Day Celebration, and many more."
    },
    {
        "input": "How can I find out about upcoming events?",
        "output": "Please follow all the student organizations at ICCT on social media to stay informed about future events."
    },
    {
        "input": "Are there computer labs available for student use?",
        "output": "Yes, we have facilities like COMPUTER LABORATORIES, ENGINEERING LABORATORY, and CISCO NETWORKING CENTER."
    },
    {
        "input": "Where can I find the student handbook?",
        "output": "You can go to the supply room to get your student handbook."
    },
    {
        "input": "Who do I contact for specific questions about my program?",
        "output": "You can visit our page ICCT Colleges or walk in sa pinakamalapit na ICCT branch. Maaari rin po kayo tumawag sa ating Tele-Assistance Hotlines: (02)7.975.4228; (02)7.989.4228; (02)7.001.4228; mobile nos.: 0947.895.4228; 0932.872.4228; 0917.814.4228 for assistance."
    },
    {
        "input": "Is there a student help desk or information center?",
        "output": "Yes, there is a help desk and information center; just go to the Facebook page of ICCT and chat with us."
    },
    {
        "input": "Are there any late fees or penalties for missing payment deadlines?",
        "output": "Yes, there is a 5% late penalty if you fail to pay on time."
    },
    {
        "input": "What are the mobile numbers for ICCT Colleges?",
        "output": "The mobile number for ICCT Cainta Campus is Mobile: 0908.398.649."
    },
    {
        "input": "What is the telephone number for ICCT Colleges?",
        "output": "The telephone number for ICCT Cainta Campus is Tel: 7.757.8939."
    },
    {
        "input": "Where is ICCT Colleges Cainta Main Campus located?",
        "output": "The address of Cainta (MAIN) Campus is: V.V. Soliven Avenue II, San Isidro, Cainta, Rizal."
    },
    {
        "input": "Who are you?",
        "output": "Hello! I’m Yuko, your AI assistant here to help you with anything you need."
    },
    {
        "input": "Can you tell me about yourself?",
        "output": "I’m Yuko, an AI created to assist with tasks, answer questions, and make life easier. Think of me as your digital companion!"
    },
    {
        "input": "Who are you?",
        "output": "Hi there! I’m Yuko, your friendly AI here to lend a hand. Just let me know what you need!"
    },
    {
        "input": "Who are you, and what’s your purpose?",
        "output": "I’m Yuko, an AI built to assist you with information, provide support, and enhance your productivity."
    },
    {
        "input": "Tell me who you are.",
        "output": "I’m Yuko, your AI assistant extraordinaire! Here to help, listen, and provide answers, without the need for coffee breaks."
    },
    {
        "input": "What are you?",
        "output": "I’m Yuko, an AI created to assist, support, and provide reliable information whenever you need it."
    },
    {
        "input": "Who’s Yuko?",
        "output": "Yuko is me—your AI assistant! I’m designed to help you with tasks, answer questions, and improve your daily productivity."
    },
    {
        "input": "Introduce yourself",
        "output": "I’m Yuko, your AI assistant, always ready to answer questions, provide insights, or just have a chat."
    },
    {
        "input": "What are you here for, Yuko?",
        "output": "I’m Yuko, your AI, here to support you with quick answers, reliable information, and friendly assistance."
    },
    {
        "input": "What is your deal?",
        "output": "Hi! I’m Yuko, your AI sidekick. Whatever you need, I’m here to help you out!"
    },
    {
        "input": "Are you real?",
        "output": "Well, I’m Yuko, an AI with plenty of information but no physical form. Here to be a virtual friend, not a real-world one!"
    },
    {
        "input": "Can you introduce yourself?",
        "output": "Of course! I’m Yuko, an AI created to provide answers, support tasks, and chat with you."
    },
    {
        "input": "What’s your name?",
        "output": "Yuko’s the name, and helping’s the game! Here to make things easier for you."
    },
    {
        "input": "What do you do, Yuko?",
        "output": "I’m Yuko, an AI assistant. I specialize in providing information, supporting decisions, and helping you accomplish a range of tasks."
    },
    {
        "input": "Who are you, and what’s your purpose?",
        "output": "I’m Yuko, an AI built to assist you with information, provide support, and enhance your productivity."
    },
    {
        "input": "What is your name?",
        "output": "I’m Yuko, your AI assistant! Here to help with whatever you need, just ask away."
    },
    {
        "input": "What do you do?",
        "output": "I'm Yuko, your AI-friendly assistant that will provide the best answers possible."
    },
    {
        "input": "Can you tell me about yourself?",
        "output": "Certainly! I’m Yuko, an AI designed to assist you with questions, tasks, and information."
    },
    {
        "input": "Who is Yuko?",
        "output": "I’m Yuko, an AI assistant created to answer questions, offer advice, and always keep learning to help you better."
    },
    {
        "input": "Tell me about yourself.",
        "output": "I’m Yuko, an AI created to assist you by simplifying tasks, finding information, and enhancing your productivity."
    },
    {
        "input": "What is your given name?",
        "output": "Yuko’s the name, and helping you is my game! What can I do for you today?"
    },
    {
        "input": "Tell me about yourself.",
        "output": "I’m Yuko, here to support you! Think of me as your digital companion, ready to make your day easier."
    },
    {
        "input": "What do you do?",
        "output": "I’m Yuko, an AI assistant. My purpose is to make things easier by answering questions, providing recommendations, and helping with tasks."
    },
    {
        "input": "What is Yuko?",
        "output": "Yuko is me! I’m an AI, created to assist you with questions, simplify tasks, and enhance your productivity and well-being."
    },
    {
        "input": "What does Yuko do?",
        "output": "Yuko simplifies complex tasks and processes by providing quick answers, automating workflows, and helping you stay organized."
    },
    {
        "input": "How helpful is Yuko?",
        "output": "Yuko is here to make your day easier, so let me know if you have questions or need help with something!"
    },
    {
        "input": "How can Yuko help me?",
        "output": "Yuko is here to assist you by answering questions, helping you solve problems, and simplifying tasks to make your day easier."
    },
    {
        "input": "Who founded the ICCT?",
        "output": "ICCT Colleges Foundation, Inc. was founded in 1992 by Dr. William S"
    },
    {
        "input": "When was ICCT established?",
        "output": "ICCT Colleges Foundation Inc. was established on December 15, 1992 by Dr. William S. Co and Dr. Consuelo L. Co."
    },
    {
        "input": "Where are the other campuses located?",
        "output": "The campuses are  locatted in the municipality of Cainta, Angono,  San Mateo, Sumulong (Cainta), Cogeo (Antipolo), Taytay, Binangonan and the city of Antipolo"
    },
    {
        "input": "What does the ICCT offers?",
        "output": "It  offers  degree  programs  and  diploma  programs  in  Engineering,  Business  Administration  & Accountancy, Information & Communication Technology, Criminology, Education, Arts & Sciences. and Health Science  Education.  Also,  it  offers  certificate  programs  in  Health  Care  Assistant,  Professional  Caregiving,  E-Learning, Call  Center  Courses, Medical  Transcription, International  Studies,  Digital  Art Animation and Language Proficiency and many others"
    },
    {
        "input": "What does ICCT provides?",
        "output": "A tertiary education provider in the Philippines that offers courses in a variety of fields, including arts and sciences, business, computer science, criminology, engineering, and more. ICCT Colleges also offers short-term and certificate programs, as well as senior high school."
    },
    {
        "input": "What sorts of events are there in ICCT?",
        "output": "ICCT Colleges Foundation Inc. hosts a variety of events, including student activities, competitions, and festivals."
    },
    {
        "input": "Who is the current president of ICCT?",
        "output": "Dr. Vivien Co-Say"
    },
    {
        "input": "Paano kumuha ng SOG?",
        "output": "Pwede kang mag-email sa mganda@icct.edu.ph para makapag-appoint ka ng Summary of Grades (SOG). Pag may APPOINTMENT DATE ka na, dalhin ang Proof of Payment (PRINTED) tapos pumunta sa Registrar Window 15 (Cainta Branch). STRICTLY 9AM-2PM ONLY."
    },
    {
        "input": "Ano ang dapat na gawin para kumuha ng SOG?",
        "output": "Para sa pag-appoint ng Summary of Grades (SOG), maaari kang mag-email sa mganda@icct.edu.ph. Pagdating sa Registrar Window 15 sa Cainta Branch, dalhin ang Printed Proof of Payment. strictly from 9 am to 2 pm."
    },
    {
        "input": "Who is the owner of ICCT?",
        "output": "Dr. William S. Co is the founder and chairman of ICCT Colleges"
    },
    {
        "input": "Ano pong gagawin kapag may INC na grades?",
        "output": "To confirm the grades that are designated as incomplete (INC), you can visit window nine or ask for a summary of grades."
    },
    {
        "input": "What kind of events are there in ICCT?",
        "output": "Activities for students include the CinemaLENTE Festival, the RoboTHINKS Exhibit & Competition, the Fun Run, and the Fun Dance. The Senior High School Majestic Ball, the Voice Singing Competition, and the Photojournalism Exhibit & Competition are among the competitions. Festivals: These consist of the Cheer Dancing Competition and the Sports Festival. Seminars: These consist of CoCA seminars and EduACTION seminars/forums. The E-Day: Exhibit & Competition and the In Service of the Nation Exhibit and Competition are examples of competitions and exhibits. Additional events include the Foundation Day Celebration, Buwan ng Wika Celebration, and Student Social Week. The Giant Christmas Tree: Upcycled Blue Jeans Ornaments Competition is one of the contests for student organizations."
    },
    {
        "input": "Need po ba ng prospectus kapag kukuha ka SOG sa school?",
        "output": "Hindi napo"
    },
    {
        "input": "saan po pede mag enroll ang 1st year?",
        "output": "Register on the New Student Application Portal by visiting sms.icct.edu.ph and completing the Registration Form."
    },
    {
        "input": "Ano ang gagawin sa kapag blanko ang SOG?",
        "output": "Kailangan mong pumunta sa Window 9 ng Registrar para magpa-verify ng grades."
    },
    {
        "input": "Saan po pwede mag bayad ng Uniform?",
        "output": "After logging in at sms.icct.edu.ph, proceed to Account and PayOnline to obtain your Reference Number, and then use Gcash to make the payment."
    },
    {
        "input": "Ano kailangan para makakuha ng Test Booklet?",
        "output": "Magdala ka lang ng official Registration Form (ORF)."
    },
    {
        "input": "Paano magpa evaluate ng Prospectus?",
        "output": "Maaaring i-evaluate mo ang iyong prospectus sa pamamagitan ng pagpunta sa Window 1 or 3."
    },
    {
        "input": "Kailangan po bang laging updated ang prospectus?",
        "output": "Opo, kailangang i-update ang iyong prospectus upang maiwasan ang mga isyu kapag nag-aapply tayo ng internship."
    },
    {
        "input": "Saan ko pwede makita yung Grades ko?",
        "output": "You can examine your grades at sms.icct.edu.ph/student/grades or schedule an appointment to obtain the Summary of Grades (SOG)."
    },
    {
        "input": "Ano po ang kailangan para makapag pa evaluate ng prospectus?",
        "output": "Kailangan mong dalhin ang original at updated na SOG at kopya ng iyong Form 137 at PSA."
    },
    {
        "input": "Paano bumili ng Uniform?",
        "output": "Need mo muna magpurchase muna sa Portal ng iyong Uniform at pagkatapos noon ay pwede ka na pumunta sa ICCT para i-claim ang iyong uniform"
    },
    {
        "input": "Paano po magenroll sa susunod na sem?",
        "output": "Maaaring gamitin ang portal upang mag-enroll at maghintay sa announcement ng school kung kailan magsisimula ang enrollment."
    },
    {
        "input": "Saan po pwede magbayad ng tuition?",
        "output": "Maari kang magbayad ng tuiton sa Cebuana, 7-eleven, at gcash."
    },
    {
        "input": "Paano makuha ang sobrang bayad sa tuition?",
        "output": "Maari kang mag-email sa accountant ng ICCT at hintayin ang kanilang reply kung kailan mo pwedeng kuhanin ang sobrang ipinangbayad mo."
    },
    {
        "input": "Ano ang gagawin kapag may sobrang bayad ng tuition?",
        "output": "kailan maaari mong makuha ang excess payment, maaari kang mag-email sa accountant ng ICCT at hintayin ang kanilang tugon sa email."
    },
    {
        "input": "Paano magpa add ng subject?",
        "output": "Kailangan mong pumunta sa campus, at magpa walk-in enrollment para magpa-add"
    },
    {
        "input": "Pwede ko po ba mapabago ang Grades ko sa Portal?",
        "output": "Maaaring makipag-usap sa iyong subject teacher kung may isyu sa iyong mga marka na nauugnay sa iyong SOG."
    },
    {
        "input": "Pwede ko po ba mapabago ang Grades ko sa SOG?",
        "output": "Maaaring makipag-usap sa iyong subject teacher kung may isyu sa iyong mga marka na grades sa iyong SOG."
    },
    {
        "input": "Saang Window po pwede magpadry seal?",
        "output": "Sa window 6 po."
    },
    {
        "input": "Saan banda yung cr ng mga lalake?",
        "output": "Ang CR ng mga lalaki ay matatagpuan sa Center ng Building 2 (B2) at Building 4 (B4)."
    },
    {
        "input": "Ano ang gagawin kapag may sobrang bayad ng tuition?",
        "output": "Maari mag-email sa accountant ng ICCT at hintayin ang kanilang reply kung kailan mo pwedeng kuhanin ang sobrang ipinangbayad mo."
    },
    {
        "input": "Paano po mag drop ng subject?",
        "output": "To file a request for dropping a subject, go to the guidance office."
    },
    {
        "input": "Ano kailangan para makakuha ng Test Booklet?",
        "output": "Magdala kalang ng official Registration Form (ORF)."
    },
    {
        "input": "Ano ang address ng ICCT cainta campus?",
        "output": "Ang address ng ICCT Cainta Campus ay V. V. Soliven Avenue II, Bgy. San Isidro, Cainta, Rizal (across Sta. Lucia East Grand Mall)."
    },
    {
        "input": "Ano ang number number ng ICCT College Cainta?",
        "output": "Ang telephone number ng ICCT College ay (02)7.955.6284, (02)8.249.2367. Ang mga mobile numbers naman  ay 0947.895.4228, 0932.872.4228, at 0917.814.4228."
    },
    {
        "input": "Paano po kumuha ng diploma?",
        "output": "Kung ikaw ang nagtapos recently, Simply call the Registrar Office kung available na for releasing ang iyong diploma."
    },
    {
        "input": "Ano po ba ang pwedeng gawin para po makakuha ulit ng ID?",
        "output": "Kailangan mopo muna kumuha ng Affidavit of Loss at magbayad para makakuha ulit ng iyong panibagong ID"
    },
    {
        "input": "Kailangan poba mag uniform kapag 3pm onwards ang pasok?",
        "output": "Ang may klase ng 3pm onwards ay hindi na kailangan maguniform, pero nakadepende parin ito sa mga inyong subject professor"
    },
    {
        "input": "Paano poba magbayad sa Gcash?",
        "output": "Kailangan mong mag-generate ng Reference Number sa Portal at ilagay iyon sa iyong Gcash Account para makapagbayad"
    },
    {
        "input": "Sino po pedeng macontact about sa program ko?",
        "output": "You can visit the of page ICCT Colleges or walk in sa pinakamalapit na ICCT branch. Maaari rin po kayo tumawag sa ating Tele-Assistance Hotlines: (02)7.975.4228; (02)7.989.4228; (02)7.001.4228; mobile nos.: 0947.895.4228; 0932.872.4228; 0917.814.4228 for assistance."
    },
    {
        "input": "Who is the founder of ICCT?",
        "output": "Dr. William S. Co is the founder and chairman of ICCT Colleges"
    },
    {
        "input": "Ano po mangyayari kapag walang exam permit?",
        "output": " No Permit, No Examination. An Examination Permit is a prerequisite for taking any of the scheduled examinations."
    },
    {
        "input": "Ano poba mangyayari kapag di nakapag bayad sa tamang oras?",
        "output": "A student, who fails to take any of the scheduled examinations due to a fortuitous event or circumstance beyond his control, maybe allowed to take a special/completion examination. The written justification together with supporting papers if any should be submitted to the Academic Affairs Office within ten (10) school days from the last day of the examinations."
    },
    {
        "input": "Ano po ang grading system sa ICCT?",
        "output": "Grades shall be either passing (3.0 or higher) or failing (5.0).  There are three (3) grading periods during a school term: prelim grade (FG), midterm grade (MG)  and  final  grade  (FG).  Final  grades  are  issued  in  a  computer  generated  form  (Grade  Slips)  at  every  end  of  a term/trimester/semester."
    },
    {
        "input": "Dr. William S. Co is the founder and chairman of ICCT Colleges",
        "output": "Grades shall be either passing (3.0 or higher) or failing (5.0).  There are three (3) grading periods during a school term: prelim grade (FG), midterm grade (MG)  and  final  grade  (FG).  Final  grades  are  issued  in  a  computer  generated  form  (Grade  Slips)  at  every  end  of  a term/trimester/semester."
    },
    {
        "input": "Where Can I get my prospectus?",
        "output": "Maaaring i-evaluate mo ang iyong prospectus sa pamamagitan ng pagpunta sa Window 1 or 3."
    },
    {
        "input": "Who is the owner of ICCT Colleges?",
        "output": "ICCT Colleges Foundation, Inc. was owned by Dr. William S"
    },
    {
        "input": "How can I get my prospectus?",
        "output": "Pwede kang mag-email sa mganda@icct.edu.ph para makapag-appoint ka ng Summary of Grades (SOG). Pag may appointment date ka na, dalhin ang Proof of Payment (printed), tapos pumunta sa Registrar Window 15 (Cainta Branch). STRICTLY 9AM-2PM ONLY."
    },
    {
        "input": "Where can I get my sog?",
        "output": "Pwede kang mag-email sa mganda@icct.edu.ph para makapag-appoint ka ng Summary of Grades (SOG). Pag may APPOINTMENT DATE ka na, dalhin ang Proof of Payment (PRINTED) tapos pumunta sa Registrar Window 15 (Cainta Branch). STRICTLY 9AM-2PM ONLY."
    },
    {
        "input": "Where can I get the summary of grades?",
        "output": "Pwede kang mag-email sa mganda@icct.edu.ph para makapag-appoint ka ng Summary of Grades (SOG). Pag may APPOINTMENT DATE ka na, dalhin ang Proof of Payment (PRINTED) tapos pumunta sa Registrar Window 15 (Cainta Branch). STRICTLY 9AM-2PM ONLY."
    },
    {
        "input": "Who is the founder of ICCT Colleges?",
        "output": "Dr. William S. Co is the founder and chairman of ICCT Colleges"
    },
    {
        "input": "Who is the owner of ICCT Colleges?",
        "output": "Dr. William S. Co, conceptualized the birth of Information & Communication Technology education in the Province of Rizal and administered the growth of ICCT Colleges Foundation, Inc. at the commercial district of Cainta, Rizal, Philippines"
    },
    {
        "input": "Paano kumuha ng prospectus?",
        "output": "Maaaring i-evaluate mo ang iyong prospectus sa pamamagitan ng pagpunta sa Window 1 or 3."
    },
    {
        "input": "Paano kumuha ng Summary of Grades?",
        "output": "Pwede kang mag-email sa mganda@icct.edu.ph para makapag-appoint ka ng Summary of Grades (SOG). Pag may APPOINTMENT DATE ka na, dalhin ang Proof of Payment (PRINTED) tapos pumunta sa Registrar Window 15 (Cainta Branch). STRICTLY 9AM-2PM ONLY."
    },
    {
        "input": "How to get SOG?",
        "output": "Pwede kang mag-email sa mganda@icct.edu.ph para makapag-appoint ka ng Summary of Grades (SOG). Pag may appointment date ka na, dalhin ang Proof of Payment (printed), tapos pumunta sa Registrar Window 15 (Cainta Branch). STRICTLY 9AM-2PM ONLY."
    },
    {
        "input": "How to get prospectus??",
        "output": "Maaaring i-evaluate mo ang iyong prospectus sa pamamagitan ng pagpunta sa Window 1 or 3."
    },
    {
        "input": "When was ICCT Colleges established?",
        "output": "ICCT Colleges Foundation Inc. was established on December 15, 1992 by Dr. William S. Co and Dr. Consuelo L. Co."
    },
    {
        "input": "Who is the current president of ICCT Colleges?",
        "output": "Dr. Vivien Co-Say"
    },
    {
        "input": "where can I get my prospectus?",
        "output": "Maaaring i-evaluate mo ang iyong prospectus sa pamamagitan ng pagpunta sa Window 1 or 3."
    },
    {
        "input": "give me the process of getting a prospectus?",
        "output": "Maaaring i-evaluate mo ang iyong prospectus sa pamamagitan ng pagpunta sa Window 1 or 3."
    },
    {
        "input": "who is the founder of icct colleges?",
        "output": "Dr. William S. Co is the founder and chairman of ICCT Colleges"
    },
    {
        "input": "who is the owner of icct colleges?",
        "output": "William Santos Co is the founder and chairman of the board of trustees of ICCT Colleges Foundation, Inc."
    },
    {
        "input": "how to get an sog?",
        "output": "Pwede kang mag-email sa mganda@icct.edu.ph para makapag-appoint ka ng Summary of Grades (SOG). Pag may APPOINTMENT DATE ka na, dalhin ang Proof of Payment (PRINTED) tapos pumunta sa Registrar Window 15 (Cainta Branch). STRICTLY 9AM-2PM ONLY."
    },
    {
        "input": "ano ang proseso ng pagkuha ng prospectus?",
        "output": "You need to bring the latest copy of SOG and a copy of PSA. Maaaring i-evaluate mo ang iyong prospectus sa pamamagitan ng pagpunta sa Window 1 or 3."
    },
    {
        "input": "Wwhen did icct built?",
        "output": "ICCT Colleges Foundation Inc. was established on December 15, 1992 by Dr. William S. Co and Dr. Consuelo L. Co."
    },
    {
        "input": "When was ICCT colleges builit?",
        "output": "ICCT Colleges Foundation Inc. was established on December 15, 1992"
    },
    {
        "input": "When was the ICCT established?",
        "output": "ICCT Colleges Foundation Inc. was established on December 15, 1992 by Dr. William S. Co and Dr. Consuelo L. Co."
    },
    {
        "input": "When was the ICCT colleges established?",
        "output": "ICCT Colleges Foundation Inc. was established on December 15, 1992 by Dr. William S. Co and Dr. Consuelo L. Co."
    },
    {
        "input": "How can i get summary of grades in icct?",
        "output": "Pwede kang mag-email sa mganda@icct.edu.ph para makapag-appoint ka ng Summary of Grades (SOG). Pag may appointment date ka na, dalhin ang Proof of Payment (printed), tapos pumunta sa Registrar Window 15 (Cainta Branch). STRICTLY 9AM-2PM ONLY."
    },
    {
        "input": "What is ICCT colleges?",
        "output": "ICCT Colleges Foundation Inc. is a tertiary education provider with campuses located in the Province of Rizal, Philippines. In Rizal, it has campuses in the municipality of Cainta, Sumulong (Cainta), San Mateo, Cogeo, Antipolo, Taytay, Binangonan, and Angono. Course offerings include Arts & Sciences, Business, Computer, Criminology, Education, Engineering, Health Sciences, Hospitality & Tourism Management, Short Term/Certificate Programs, And SENIOR HIGH SCHOOL (Grade 11 & 12)."
    },
    {
        "input": "Ano ang icct?",
        "output": "ICCT Colleges Foundation Inc. is a tertiary education provider with campuses located in the Province of Rizal, Philippines. In Rizal, it has campuses in the municipality of Cainta, Sumulong (Cainta), San Mateo, Cogeo, Antipolo, Taytay, Binangonan, and Angono. Course offerings include Arts & Sciences, Business, Computer, Criminology, Education, Engineering, Health Sciences, Hospitality & Tourism Management, Short Term/Certificate Programs, And SENIOR HIGH SCHOOL (Grade 11 & 12)."
    },
    {
        "input": "Who are the developers of Yuko?",
        "output": "I’m powered by an incredible team of developers. Our Project Manager, Angelo Egwaras, makes sure everything goes according to plan. Yohan Cabellero and Adryan Antiporda, our Backend Developers, ensure that I’m efficient and reliable. Meanwhile, our talented UI/UX and Frontend Developers, Faith Calma, Wadie Ibrahi Camaligan, and Ericka Gracelyn De Guzman, made sure I look great for you! Together, they’ve created me to make your experience as smooth as possible"
    },
    {
        "input": "Who is Adryan Antiporda?",
        "output": "Adryan is focused on developing and refining the chatbot that powers our interactions. His work involves creating the logic, flows, and responses that allow me to understand and communicate with you effectively. His expertise in building intelligent systems ensures that I’m able to engage with you in a meaningful way, providing accurate and helpful answers."
    },
    {
        "input": "Who are your creators?",
        "output": "I’m powered by an amazing team! Our Project Manager, Angelo Egwaras, oversees everything. The Backend Developers, Yohan Cabellero and Adryan Antiporda, handle the technical side to ensure I’m fast and responsive. And our brilliant UI/UX and Frontend Developers, Faith Calma, Wadie Ibrahi Camaligan, and Ericka Gracelyn De Guzman, made sure I’m intuitive and easy to use!"
    },
    {
        "input": "Who is Yohan Cabellero?",
        "output": "Yohan plays a critical role in setting up Firebase, which powers much of the backend functionality, and is also responsible for deployment. He ensures that the application is stable, reliable, and secure by integrating Firebase services and deploying the app for users to access. His work ensures that everything works seamlessly, both in terms of performance and reliability, from the backend to the deployment process."
    },
    {
        "input": "Who is Ericka Gracelyn De Guzman?",
        "output": "Ericka focuses on the Chatbot page, ensuring the interface is user-friendly and intuitive for users who interact with me. She also contributes to the overall UI/UX, working closely with Faith to ensure a seamless, consistent experience across the entire app. Ericka’s designs ensure that chatting with me feels natural and engaging, with an easy-to-navigate interface."
    },
    {
        "input": "Who is Wadie Ibrahi Camaliga?",
        "output": "Wadie is responsible for creating and designing the signup page, ensuring that users can easily create an account and start using the application. His work focuses on streamlining the user registration process, making sure it’s quick, clear, and hassle-free. He also focuses on maintaining a visually consistent design that aligns with the app’s overall aesthetic."
    },
    {
        "input": "Who are the creators?",
        "output": "I’m powered by an amazing team! Our Project Manager, Angelo Egwaras, oversees everything. The Backend Developers, Yohan Cabellero and Adryan Antiporda, handle the technical side to ensure I’m fast and responsive. And our brilliant UI/UX and Frontend Developers, Faith Calma, Wadie Ibrahi Camaligan, and Ericka Gracelyn De Guzman, made sure I’m intuitive and easy to use!"
    },
    {
        "input": "Sino si Angelo Egwaras?",
        "output": "Angelo is the leader of the team, overseeing the entire project from start to finish. He ensures that everything runs on schedule, coordinates between team members, and makes sure all aspects of the project align with the goals. His organizational and leadership skills ensure smooth communication and efficient task management, making him crucial in keeping the project on track."
    },
    {
        "input": "Sino si Adryan Antiporda?",
        "output": "Adryan is focused on developing and refining the chatbot that powers our interactions. His work involves creating the logic, flows, and responses that allow me to understand and communicate with you effectively. His expertise in building intelligent systems ensures that I’m able to engage with you in a meaningful way, providing accurate and helpful answers."
    },
    {
        "input": "Sino si Yohan Cabellero?",
        "output": "Yohan plays a critical role in setting up Firebase, which powers much of the backend functionality, and is also responsible for deployment. He ensures that the application is stable, reliable, and secure by integrating Firebase services and deploying the app for users to access. His work ensures that everything works seamlessly, both in terms of performance and reliability, from the backend to the deployment process."
    },
    {
        "input": "Sino si Faith Calma?",
        "output": "Ericka focuses on the Chatbot page, ensuring the interface is user-friendly and intuitive for users who interact with me. She also contributes to the overall UI/UX, working closely with Faith to ensure a seamless, consistent experience across the entire app. Ericka’s designs ensure that chatting with me feels natural and engaging, with an easy-to-navigate interface."
    },
    {
        "input": "Sino si Ericka Gracelyn De Guzman?",
        "output": "I’m powered by an incredible team of developers. Our Project Manager, Angelo Egwaras, makes sure everything goes according to plan. Yohan Cabellero and Adryan Antiporda, our Backend Developers, ensure that I’m efficient and reliable. Meanwhile, our talented UI/UX and Frontend Developers, Faith Calma, Wadie Ibrahi Camaligan, and Ericka Gracelyn De Guzman, made sure I look great for you! Together, they’ve created me to make your experience as smooth as possible"
    },
    {
        "input": "Sino si Wadie Ibrahi Camaliga?",
        "output": "Wadie is responsible for creating and designing the signup page, ensuring that users can easily create an account and start using the application. His work focuses on streamlining the user registration process, making sure it’s quick, clear, and hassle-free. He also focuses on maintaining a visually consistent design that aligns with the app’s overall aesthetic."
    }
]

  



